; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=3, packages=3, locations=8, density=0.25, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=15, seed=56

(define (problem transport-15)
 (:domain transport)
 (:objects 
    v1 v2 v3 - vehicle
    p1 p2 p3 - package
    l1 l2 l3 l4 l5 l6 l7 l8 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l7)
    (at p2 l4)
    (at p3 l2)
    (at v1 l6)
    (at v2 l2)
    (at v3 l6)
    (road l7 l4)
    (road l3 l8)
    (road l3 l4)
    (road l4 l3)
    (road l6 l1)
    (road l5 l4)
    (road l4 l6)
    (road l6 l4)
    (road l2 l3)
    (road l8 l3)
    (road l4 l5)
    (road l1 l6)
    (road l3 l2)
    (road l4 l7)
    )
 (:goal  (and 
    (at p1 l1)
    (at p2 l1)
    (at p3 l6))))

; plan
1. (pick-up v2 l2 p3 c1 c2)
   deleted: (at p3 l2) (capacity v2 c2)
   added: (in p3 v2) (capacity v2 c1)
   goals met: 0 of 3
2. (drive v3 l6 l4)
   deleted: (at v3 l6)
   added: (at v3 l4)
   goals met: 0 of 3
3. (drive v3 l4 l7)
   deleted: (at v3 l4)
   added: (at v3 l7)
   goals met: 0 of 3
4. (pick-up v3 l7 p1 c1 c2)
   deleted: (at p1 l7) (capacity v3 c2)
   added: (in p1 v3) (capacity v3 c1)
   goals met: 0 of 3
5. (drive v3 l7 l4)
   deleted: (at v3 l7)
   added: (at v3 l4)
   goals met: 0 of 3
6. (pick-up v3 l4 p2 c0 c1)
   deleted: (at p2 l4) (capacity v3 c1)
   added: (in p2 v3) (capacity v3 c0)
   goals met: 0 of 3
7. (drive v3 l4 l6)
   deleted: (at v3 l4)
   added: (at v3 l6)
   goals met: 0 of 3
8. (drive v3 l6 l1)
   deleted: (at v3 l6)
   added: (at v3 l1)
   goals met: 0 of 3
9. (drop v3 l1 p1 c0 c1)
   deleted: (in p1 v3) (capacity v3 c0)
   added: (at p1 l1) (capacity v3 c1)
   goals met: 1 of 3
10. (drop v3 l1 p2 c1 c2)
   deleted: (in p2 v3) (capacity v3 c1)
   added: (at p2 l1) (capacity v3 c2)
   goals met: 2 of 3
11. (drive v2 l2 l3)
   deleted: (at v2 l2)
   added: (at v2 l3)
   goals met: 2 of 3
12. (drive v2 l3 l4)
   deleted: (at v2 l3)
   added: (at v2 l4)
   goals met: 2 of 3
13. (drive v2 l4 l6)
   deleted: (at v2 l4)
   added: (at v2 l6)
   goals met: 2 of 3
14. (drop v2 l6 p3 c1 c2)
   deleted: (in p3 v2) (capacity v2 c1)
   added: (at p3 l6) (capacity v2 c2)
   goals met: 3 of 3
